performance.yml
config:
  target: "https://api.todoist.com/rest/v1"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 15
      arrivalRate: 100
      name: "Peak load"
    - duration: 60
      arrivalRate: 10
      name: "Normal traffic"
  defaults:
    headers:
      Content-type: application/json
      Authorization: Bearer {{ $processEnvironment.TOKEN }}
  processor: "./processor.js"

scenarios:
  - flow:
      - function: "generateLoremIpsum"
        # Get tasks
      - get:
          url: "/tasks"
        # Create task
      - post:
          url: "/tasks"
          json:
            content: "{{content}}"
          capture:
            json: "$.id"
            as: "taskId"
        # Get task
      - get:
          url: "/tasks/{{taskId}}"
          capture:
            json: "$.content"
            as: "taskContent"
      - function: "generateLoremIpsum"
        # Update task
      - post:
          url: "/tasks/{{taskId}}"
          json:
            content: "{{content}}"
          expect:
            statusCode: 204
        # Change status to complete
      - post:
          url: "/tasks/{{taskId}}/close"
          expect:
            statusCode: 204
        # Reopen a task
      - post:
          url: "/tasks/{{taskId}}/reopen"
          expect:
            statusCode: 204
        # Delete a task
      - delete:
          url: "/tasks/{{taskId}}"
          expect:
            statusCode: 204